{"format": "graph-model", "generatedBy": "2.18.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"keras_tensor_17": {"name": "keras_tensor_17:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "62"}]}}, "keras_tensor_18": {"name": "keras_tensor_18:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "512"}]}}}, "outputs": {"output_1": {"name": "Identity_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "512"}]}}, "output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "62"}, {"size": "512"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/Max", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "_has_manual_control_dependencies": {"b": true}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "_has_manual_control_dependencies": {"b": true}, "dtype": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/input/_3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}, {"size": "1536"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_4", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "1536"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_5", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "1536"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/encoder_1/embedding_1/GatherV2/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "373"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/encoder_1/embedding_1/Less/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/encoder_1/embedding_1/strided_slice", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/encoder_1/embedding_1/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/TensorArrayV2_1/num_elements", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "keras_tensor_17", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "62"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "keras_tensor_18", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "512"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/TensorArrayV2_1/num_elements"], "attr": {"shape_type": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/functional_2_1/encoder_1/embedding_1/Cast", "op": "Cast", "input": ["keras_tensor_17"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_INT32"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_2_1/encoder_1/embedding_1/Less", "op": "Less", "input": ["StatefulPartitionedCall/functional_2_1/encoder_1/embedding_1/Cast", "StatefulPartitionedCall/functional_2_1/encoder_1/embedding_1/Less/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/encoder_1/embedding_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_2_1/encoder_1/embedding_1/Cast", "StatefulPartitionedCall/functional_2_1/encoder_1/embedding_1/strided_slice"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/encoder_1/embedding_1/SelectV2", "op": "SelectV2", "input": ["StatefulPartitionedCall/functional_2_1/encoder_1/embedding_1/Less", "StatefulPartitionedCall/functional_2_1/encoder_1/embedding_1/add", "StatefulPartitionedCall/functional_2_1/encoder_1/embedding_1/Cast"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/encoder_1/embedding_1/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/functional_2_1/encoder_1/embedding_1/GatherV2/ReadVariableOp", "StatefulPartitionedCall/functional_2_1/encoder_1/embedding_1/SelectV2", "StatefulPartitionedCall/functional_2_1/encoder_1/embedding_1/GatherV2/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "Tparams": {"type": "DT_FLOAT"}, "Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/transpose", "op": "Transpose", "input": ["StatefulPartitionedCall/functional_2_1/encoder_1/embedding_1/GatherV2", "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/transpose", "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"shape_type": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/LoopControlInputs/_20", "op": "NoOp", "input": ["^keras_tensor_18", "^StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/TensorArrayUnstack/TensorListFromTensor", "^StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/TensorArrayV2_1"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/enter/_16", "op": "Enter", "input": ["StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/TensorArrayUnstack/TensorListFromTensor", "^StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/LoopControlInputs/_20"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZnVuY3Rpb25hbF8yXzEvZW5jb2Rlcl8xL2dydV8xL3doaWxl"}, "T": {"type": "DT_VARIANT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/enter/_12", "op": "Enter", "input": ["StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/Max", "^StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/LoopControlInputs/_20"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZnVuY3Rpb25hbF8yXzEvZW5jb2Rlcl8xL2dydV8xL3doaWxl"}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/enter/_14", "op": "Enter", "input": ["StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/TensorArrayV2_1", "^StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/LoopControlInputs/_20"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZnVuY3Rpb25hbF8yXzEvZW5jb2Rlcl8xL2dydV8xL3doaWxl"}, "T": {"type": "DT_VARIANT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/enter/_15", "op": "Enter", "input": ["keras_tensor_18", "^StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/LoopControlInputs/_20"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZnVuY3Rpb25hbF8yXzEvZW5jb2Rlcl8xL2dydV8xL3doaWxl"}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/enter/_13", "op": "Enter", "input": ["StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/time", "^StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/LoopControlInputs/_20"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZnVuY3Rpb25hbF8yXzEvZW5jb2Rlcl8xL2dydV8xL3doaWxl"}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/enter/_11", "op": "Enter", "input": ["StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/loop_counter", "^StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/LoopControlInputs/_20"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZnVuY3Rpb25hbF8yXzEvZW5jb2Rlcl8xL2dydV8xL3doaWxl"}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/enter/_17", "op": "Enter", "input": ["Func/StatefulPartitionedCall/input/_3", "^StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/LoopControlInputs/_20"], "attr": {"is_constant": {"b": true}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZnVuY3Rpb25hbF8yXzEvZW5jb2Rlcl8xL2dydV8xL3doaWxl"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/enter/_18", "op": "Enter", "input": ["Func/StatefulPartitionedCall/input/_4", "^StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/LoopControlInputs/_20"], "attr": {"is_constant": {"b": true}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZnVuY3Rpb25hbF8yXzEvZW5jb2Rlcl8xL2dydV8xL3doaWxl"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/enter/_19", "op": "Enter", "input": ["Func/StatefulPartitionedCall/input/_5", "^StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/LoopControlInputs/_20"], "attr": {"is_constant": {"b": true}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZnVuY3Rpb25hbF8yXzEvZW5jb2Rlcl8xL2dydV8xL3doaWxl"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/merge/_26", "op": "Merge", "input": ["StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/enter/_16", "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/next_iteration/_47"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/merge/_22", "op": "Merge", "input": ["StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/enter/_12", "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/next_iteration/_43"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/merge/_24", "op": "Merge", "input": ["StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/enter/_14", "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/next_iteration/_45"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/merge/_25", "op": "Merge", "input": ["StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/enter/_15", "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/next_iteration/_46"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/merge/_23", "op": "Merge", "input": ["StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/enter/_13", "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/next_iteration/_44"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/merge/_21", "op": "Merge", "input": ["StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/enter/_11", "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/next_iteration/_42"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/cond/_9/input_control_node/_48", "op": "NoOp", "input": ["^StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/enter/_17", "^StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/enter/_18", "^StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/enter/_19", "^StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/merge/_21", "^StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/merge/_22", "^StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/merge/_23", "^StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/merge/_24", "^StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/merge/_25", "^StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/merge/_26"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/cond/_9/functional_2_1/encoder_1/gru_1/while/Less_1", "op": "Less", "input": ["StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/merge/_21", "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/merge/_22", "^Func/StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/cond/_9/input_control_node/_48"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/cond/_9/functional_2_1/encoder_1/gru_1/while/Less/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/cond/_9/input_control_node/_48"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/cond/_9/functional_2_1/encoder_1/gru_1/while/Less", "op": "Less", "input": ["StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/merge/_23", "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/cond/_9/functional_2_1/encoder_1/gru_1/while/Less/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/cond/_9/functional_2_1/encoder_1/gru_1/while/LogicalAnd", "op": "LogicalAnd", "input": ["StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/cond/_9/functional_2_1/encoder_1/gru_1/while/Less_1", "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/cond/_9/functional_2_1/encoder_1/gru_1/while/Less"]}, {"name": "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/LoopCond/_27", "op": "LoopCond", "input": ["StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/cond/_9/functional_2_1/encoder_1/gru_1/while/LogicalAnd"]}, {"name": "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/Max_switch/_29", "op": "Switch", "input": ["StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/merge/_22", "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/LoopCond/_27"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/Func/StatefulPartitionedCall/input/_1_switch/_32", "op": "Switch", "input": ["StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/merge/_25", "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/LoopCond/_27"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/TensorArrayV2_1_switch/_31", "op": "Switch", "input": ["StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/merge/_24", "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/LoopCond/_27"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/time_switch/_30", "op": "Switch", "input": ["StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/merge/_23", "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/LoopCond/_27"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/loop_counter_switch/_28", "op": "Switch", "input": ["StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/merge/_21", "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/LoopCond/_27"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/TensorArrayUnstack/TensorListFromTensor_switch/_33", "op": "Switch", "input": ["StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/merge/_26", "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/LoopCond/_27"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/exit/_36", "op": "Exit", "input": ["StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/Max_switch/_29"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/exit/_39", "op": "Exit", "input": ["StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/Func/StatefulPartitionedCall/input/_1_switch/_32"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/exit/_38", "op": "Exit", "input": ["StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/TensorArrayV2_1_switch/_31"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/exit/_37", "op": "Exit", "input": ["StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/time_switch/_30"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/exit/_35", "op": "Exit", "input": ["StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/loop_counter_switch/_28"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/loop_body_control/_34", "op": "Identity", "input": ["StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/loop_counter_switch/_28:1"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/exit/_40", "op": "Exit", "input": ["StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/TensorArrayUnstack/TensorListFromTensor_switch/_33"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/TensorArrayV2Stack/TensorListStack", "op": "TensorListStack", "input": ["StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/exit/_38", "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/TensorArrayV2Stack/TensorListStack/element_shape"], "attr": {"num_elements": {"i": "62"}, "element_dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/input_control_node/_59", "op": "NoOp", "input": ["^StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/Func/StatefulPartitionedCall/input/_1_switch/_32", "^StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/Max_switch/_29", "^StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/TensorArrayUnstack/TensorListFromTensor_switch/_33", "^StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/TensorArrayV2_1_switch/_31", "^StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/time_switch/_30", "^StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/loop_body_control/_34", "^StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/enter/_17", "^StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/enter/_18", "^StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/enter/_19"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/LoopExecuted/_41", "op": "NoOp", "input": ["^StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/exit/_35", "^StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/exit/_36", "^StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/exit/_37", "^StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/exit/_38", "^StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/exit/_39", "^StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/exit/_40"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/transpose_1", "op": "Transpose", "input": ["StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/TensorArrayV2Stack/TensorListStack", "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/transpose_1/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/functional_2_1/encoder_1/gru_1/while/gru_cell_1/sub/x", "op": "Const", "input": ["^Func/StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/input_control_node/_59"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/functional_2_1/encoder_1/gru_1/while/gru_cell_1/strided_slice/stack", "op": "Const", "input": ["^Func/StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/input_control_node/_59"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/functional_2_1/encoder_1/gru_1/while/gru_cell_1/strided_slice/stack_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/input_control_node/_59"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/functional_2_1/encoder_1/gru_1/while/gru_cell_1/strided_slice/stack_2", "op": "Const", "input": ["^Func/StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/input_control_node/_59"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/functional_2_1/encoder_1/gru_1/while/gru_cell_1/split_1/split_dim", "op": "Const", "input": ["^Func/StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/input_control_node/_59"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/functional_2_1/encoder_1/gru_1/while/TensorArrayV2Read/TensorListGetItem/element_shape", "op": "Const", "input": ["^Func/StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/input_control_node/_59"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/functional_2_1/encoder_1/gru_1/while/gru_cell_1/Squeeze", "op": "Const", "input": ["^Func/StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/input_control_node/_59", "^StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/enter/_17"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1536"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/functional_2_1/encoder_1/gru_1/while/gru_cell_1/strided_slice_1/stack", "op": "Const", "input": ["^Func/StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/input_control_node/_59"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/functional_2_1/encoder_1/gru_1/while/gru_cell_1/strided_slice_1/stack_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/input_control_node/_59"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/functional_2_1/encoder_1/gru_1/while/gru_cell_1/strided_slice_1/stack_2", "op": "Const", "input": ["^Func/StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/input_control_node/_59"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/functional_2_1/encoder_1/gru_1/while/gru_cell_1/Squeeze_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/input_control_node/_59", "^StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/enter/_17"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1536"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/functional_2_1/encoder_1/gru_1/while/gru_cell_1/strided_slice_2/stack", "op": "Const", "input": ["^Func/StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/input_control_node/_59"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/functional_2_1/encoder_1/gru_1/while/gru_cell_1/strided_slice_2/stack_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/input_control_node/_59"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/functional_2_1/encoder_1/gru_1/while/gru_cell_1/strided_slice_2/stack_2", "op": "Const", "input": ["^Func/StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/input_control_node/_59"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/input/_62", "op": "Identity", "input": ["StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/time_switch/_30:1", "^Func/StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/input_control_node/_59"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/functional_2_1/encoder_1/gru_1/while/add/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/input_control_node/_59"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/functional_2_1/encoder_1/gru_1/while/add_1/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/input_control_node/_59"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/functional_2_1/encoder_1/gru_1/while/gru_cell_1/Cast/ReadVariableOp", "op": "Const", "input": ["^StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/enter/_18", "^Func/StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/input_control_node/_59"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "1536"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/functional_2_1/encoder_1/gru_1/while/gru_cell_1/Cast_1/ReadVariableOp", "op": "Const", "input": ["^StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/enter/_19", "^Func/StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/input_control_node/_59"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "1536"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Identity_1", "op": "Identity", "input": ["StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/exit/_39", "^StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/LoopExecuted/_41"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/transpose_1", "^StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/LoopExecuted/_41"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/functional_2_1/encoder_1/gru_1/while/TensorArrayV2Read/TensorListGetItem", "op": "TensorListGetItem", "input": ["StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/TensorArrayUnstack/TensorListFromTensor_switch/_33:1", "Func/StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/input/_62", "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/functional_2_1/encoder_1/gru_1/while/TensorArrayV2Read/TensorListGetItem/element_shape"], "attr": {"element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/functional_2_1/encoder_1/gru_1/while/add", "op": "AddV2", "input": ["Func/StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/input/_62", "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/functional_2_1/encoder_1/gru_1/while/add/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/functional_2_1/encoder_1/gru_1/while/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/loop_counter_switch/_28:1", "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/functional_2_1/encoder_1/gru_1/while/add_1/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/functional_2_1/encoder_1/gru_1/while/gru_cell_1/add_1", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/Func/StatefulPartitionedCall/input/_1_switch/_32:1", "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/functional_2_1/encoder_1/gru_1/while/gru_cell_1/Cast_1/ReadVariableOp", "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/functional_2_1/encoder_1/gru_1/while/gru_cell_1/Squeeze_1"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/output_control_node/_78", "op": "NoOp", "input": ["^StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/functional_2_1/encoder_1/gru_1/while/gru_cell_1/Cast/ReadVariableOp", "^StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/functional_2_1/encoder_1/gru_1/while/gru_cell_1/Cast_1/ReadVariableOp", "^StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/enter/_17"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/functional_2_1/encoder_1/gru_1/while/NoOp", "op": "NoOp", "input": ["^StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/functional_2_1/encoder_1/gru_1/while/gru_cell_1/Cast/ReadVariableOp", "^StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/functional_2_1/encoder_1/gru_1/while/gru_cell_1/Cast_1/ReadVariableOp", "^StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/enter/_17"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/functional_2_1/encoder_1/gru_1/while/gru_cell_1/add", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/functional_2_1/encoder_1/gru_1/while/TensorArrayV2Read/TensorListGetItem", "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/functional_2_1/encoder_1/gru_1/while/gru_cell_1/Cast/ReadVariableOp", "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/functional_2_1/encoder_1/gru_1/while/gru_cell_1/Squeeze"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/functional_2_1/encoder_1/gru_1/while/gru_cell_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/functional_2_1/encoder_1/gru_1/while/gru_cell_1/add_1", "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/functional_2_1/encoder_1/gru_1/while/gru_cell_1/strided_slice/stack", "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/functional_2_1/encoder_1/gru_1/while/gru_cell_1/strided_slice/stack_1", "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/functional_2_1/encoder_1/gru_1/while/gru_cell_1/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "3"}, "end_mask": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/functional_2_1/encoder_1/gru_1/while/gru_cell_1/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/functional_2_1/encoder_1/gru_1/while/gru_cell_1/add_1", "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/functional_2_1/encoder_1/gru_1/while/gru_cell_1/strided_slice_1/stack", "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/functional_2_1/encoder_1/gru_1/while/gru_cell_1/strided_slice_1/stack_1", "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/functional_2_1/encoder_1/gru_1/while/gru_cell_1/strided_slice_1/stack_2"], "attr": {"shrink_axis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "1"}, "end_mask": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/functional_2_1/encoder_1/gru_1/while/gru_cell_1/strided_slice_2", "op": "StridedSlice", "input": ["StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/functional_2_1/encoder_1/gru_1/while/gru_cell_1/add_1", "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/functional_2_1/encoder_1/gru_1/while/gru_cell_1/strided_slice_2/stack", "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/functional_2_1/encoder_1/gru_1/while/gru_cell_1/strided_slice_2/stack_1", "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/functional_2_1/encoder_1/gru_1/while/gru_cell_1/strided_slice_2/stack_2"], "attr": {"shrink_axis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "1"}, "end_mask": {"i": "3"}, "T": {"type": "DT_FLOAT"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/next_iteration/_47", "op": "NextIteration", "input": ["StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/TensorArrayUnstack/TensorListFromTensor_switch/_33:1", "^Func/StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/output_control_node/_78", "^Func/StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/input_control_node/_59"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/next_iteration/_43", "op": "NextIteration", "input": ["StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/Max_switch/_29:1", "^Func/StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/output_control_node/_78", "^StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/functional_2_1/encoder_1/gru_1/while/NoOp", "^Func/StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/input_control_node/_59"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/next_iteration/_44", "op": "NextIteration", "input": ["StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/functional_2_1/encoder_1/gru_1/while/add", "^Func/StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/output_control_node/_78", "^StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/functional_2_1/encoder_1/gru_1/while/NoOp"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/next_iteration/_42", "op": "NextIteration", "input": ["StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/functional_2_1/encoder_1/gru_1/while/add_1", "^Func/StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/output_control_node/_78", "^StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/functional_2_1/encoder_1/gru_1/while/NoOp"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/functional_2_1/encoder_1/gru_1/while/gru_cell_1/split_1", "op": "Split", "input": ["StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/functional_2_1/encoder_1/gru_1/while/gru_cell_1/split_1/split_dim", "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/functional_2_1/encoder_1/gru_1/while/gru_cell_1/add"], "attr": {"num_split": {"i": "3"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/functional_2_1/encoder_1/gru_1/while/gru_cell_1/add_2", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/functional_2_1/encoder_1/gru_1/while/gru_cell_1/split_1", "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/functional_2_1/encoder_1/gru_1/while/gru_cell_1/strided_slice"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/functional_2_1/encoder_1/gru_1/while/gru_cell_1/add_3", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/functional_2_1/encoder_1/gru_1/while/gru_cell_1/split_1:1", "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/functional_2_1/encoder_1/gru_1/while/gru_cell_1/strided_slice_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/functional_2_1/encoder_1/gru_1/while/gru_cell_1/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/functional_2_1/encoder_1/gru_1/while/gru_cell_1/add_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/functional_2_1/encoder_1/gru_1/while/gru_cell_1/Sigmoid_1", "op": "Sigmoid", "input": ["StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/functional_2_1/encoder_1/gru_1/while/gru_cell_1/add_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/functional_2_1/encoder_1/gru_1/while/gru_cell_1/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/functional_2_1/encoder_1/gru_1/while/gru_cell_1/Sigmoid", "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/Func/StatefulPartitionedCall/input/_1_switch/_32:1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/functional_2_1/encoder_1/gru_1/while/gru_cell_1/sub", "op": "Sub", "input": ["StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/functional_2_1/encoder_1/gru_1/while/gru_cell_1/sub/x", "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/functional_2_1/encoder_1/gru_1/while/gru_cell_1/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/functional_2_1/encoder_1/gru_1/while/gru_cell_1/mul", "op": "Mul", "input": ["StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/functional_2_1/encoder_1/gru_1/while/gru_cell_1/Sigmoid_1", "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/functional_2_1/encoder_1/gru_1/while/gru_cell_1/strided_slice_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/functional_2_1/encoder_1/gru_1/while/gru_cell_1/add_4", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/functional_2_1/encoder_1/gru_1/while/gru_cell_1/split_1:2", "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/functional_2_1/encoder_1/gru_1/while/gru_cell_1/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/functional_2_1/encoder_1/gru_1/while/gru_cell_1/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/functional_2_1/encoder_1/gru_1/while/gru_cell_1/add_4"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/functional_2_1/encoder_1/gru_1/while/gru_cell_1/mul_2", "op": "Mul", "input": ["StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/functional_2_1/encoder_1/gru_1/while/gru_cell_1/sub", "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/functional_2_1/encoder_1/gru_1/while/gru_cell_1/Tanh"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/functional_2_1/encoder_1/gru_1/while/gru_cell_1/add_5", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/functional_2_1/encoder_1/gru_1/while/gru_cell_1/mul_1", "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/functional_2_1/encoder_1/gru_1/while/gru_cell_1/mul_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/functional_2_1/encoder_1/gru_1/while/TensorArrayV2Write/TensorListSetItem", "op": "TensorListSetItem", "input": ["StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/TensorArrayV2_1_switch/_31:1", "Func/StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/input/_62", "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/functional_2_1/encoder_1/gru_1/while/gru_cell_1/add_5"], "attr": {"element_dtype": {"type": "DT_FLOAT"}, "resize_if_index_out_of_bounds": {"b": false}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/next_iteration/_46", "op": "NextIteration", "input": ["StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/functional_2_1/encoder_1/gru_1/while/gru_cell_1/add_5", "^Func/StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/output_control_node/_78", "^StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/functional_2_1/encoder_1/gru_1/while/NoOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/next_iteration/_45", "op": "NextIteration", "input": ["StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/functional_2_1/encoder_1/gru_1/while/TensorArrayV2Write/TensorListSetItem", "^Func/StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/output_control_node/_78", "^StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/body/_10/functional_2_1/encoder_1/gru_1/while/NoOp"], "attr": {"T": {"type": "DT_VARIANT"}}}], "library": {}, "versions": {"producer": 1994}}, "weightsManifest": [{"paths": ["group1-shard1of3.bin", "group1-shard2of3.bin", "group1-shard3of3.bin"], "weights": [{"name": "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/TensorArrayV2Stack/TensorListStack/element_shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/transpose_1/perm", "shape": [3], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/Max", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/time", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_2_1/encoder_1/gru_1/while/loop_counter", "shape": [], "dtype": "int32"}, {"name": 