{"format": "graph-model", "generatedBy": "2.18.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"keras_tensor_21": {"name": "keras_tensor_21:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "keras_tensor_22": {"name": "keras_tensor_22:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "512"}]}}, "keras_tensor_23": {"name": "keras_tensor_23:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "62"}, {"size": "512"}]}}}, "outputs": {"output_2": {"name": "Identity_2:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "62"}, {"size": "1"}]}}, "output_1": {"name": "Identity_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "512"}]}}, "output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "646"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/dense_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "646"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/dense_1/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "646"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/Max", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "_has_manual_control_dependencies": {"b": true}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "_has_manual_control_dependencies": {"b": true}, "dtype": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/input/_10", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}, {"size": "1536"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_11", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "768"}, {"size": "1536"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_12", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "1536"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/zeros/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/zeros/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/bahdanau_attention_1/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/bahdanau_attention_1/dense_1_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/bahdanau_attention_1/dense_1_1/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/bahdanau_attention_1/dense_2_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/bahdanau_attention_1/dense_2_1/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/bahdanau_attention_1/dense_3_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/bahdanau_attention_1/dense_3_1/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/bahdanau_attention_1/concat", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/bahdanau_attention_1/concat_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/bahdanau_attention_1/Sum/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/embedding_1_1/GatherV2/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "646"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/embedding_1_1/Less/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/embedding_1_1/strided_slice", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/embedding_1_1/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/TensorArrayV2_1/num_elements", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "keras_tensor_21", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "keras_tensor_22", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "512"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "keras_tensor_23", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "62"}, {"size": "512"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/TensorArrayV2_1/num_elements"], "attr": {"shape_type": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/embedding_1_1/Cast", "op": "Cast", "input": ["keras_tensor_21"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_INT32"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/bahdanau_attention_1/ExpandDims", "op": "ExpandDims", "input": ["keras_tensor_22", "StatefulPartitionedCall/functional_3_1/decoder_1/bahdanau_attention_1/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/bahdanau_attention_1/dense_2_1/MatMul", "op": "BatchMatMulV2", "input": ["keras_tensor_23", "StatefulPartitionedCall/functional_3_1/decoder_1/bahdanau_attention_1/dense_2_1/Cast/ReadVariableOp"], "attr": {"adj_x": {"b": false}, "grad_y": {"b": false}, "T": {"type": "DT_FLOAT"}, "grad_x": {"b": false}, "adj_y": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/embedding_1_1/Less", "op": "Less", "input": ["StatefulPartitionedCall/functional_3_1/decoder_1/embedding_1_1/Cast", "StatefulPartitionedCall/functional_3_1/decoder_1/embedding_1_1/Less/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/embedding_1_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_3_1/decoder_1/embedding_1_1/Cast", "StatefulPartitionedCall/functional_3_1/decoder_1/embedding_1_1/strided_slice"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/bahdanau_attention_1/dense_1_1/MatMul", "op": "BatchMatMulV2", "input": ["StatefulPartitionedCall/functional_3_1/decoder_1/bahdanau_attention_1/ExpandDims", "StatefulPartitionedCall/functional_3_1/decoder_1/bahdanau_attention_1/dense_1_1/Cast/ReadVariableOp"], "attr": {"adj_x": {"b": false}, "grad_y": {"b": false}, "T": {"type": "DT_FLOAT"}, "adj_y": {"b": false}, "grad_x": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/bahdanau_attention_1/dense_2_1/Add", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_3_1/decoder_1/bahdanau_attention_1/dense_2_1/MatMul", "StatefulPartitionedCall/functional_3_1/decoder_1/bahdanau_attention_1/dense_2_1/Add/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/embedding_1_1/SelectV2", "op": "SelectV2", "input": ["StatefulPartitionedCall/functional_3_1/decoder_1/embedding_1_1/Less", "StatefulPartitionedCall/functional_3_1/decoder_1/embedding_1_1/add", "StatefulPartitionedCall/functional_3_1/decoder_1/embedding_1_1/Cast"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/bahdanau_attention_1/dense_1_1/Add", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_3_1/decoder_1/bahdanau_attention_1/dense_1_1/MatMul", "StatefulPartitionedCall/functional_3_1/decoder_1/bahdanau_attention_1/dense_1_1/Add/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/embedding_1_1/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/functional_3_1/decoder_1/embedding_1_1/GatherV2/ReadVariableOp", "StatefulPartitionedCall/functional_3_1/decoder_1/embedding_1_1/SelectV2", "StatefulPartitionedCall/functional_3_1/decoder_1/embedding_1_1/GatherV2/axis"], "attr": {"Tparams": {"type": "DT_FLOAT"}, "Taxis": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/bahdanau_attention_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_3_1/decoder_1/bahdanau_attention_1/dense_1_1/Add", "StatefulPartitionedCall/functional_3_1/decoder_1/bahdanau_attention_1/dense_2_1/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/bahdanau_attention_1/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/functional_3_1/decoder_1/bahdanau_attention_1/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/bahdanau_attention_1/dense_3_1/MatMul", "op": "BatchMatMulV2", "input": ["StatefulPartitionedCall/functional_3_1/decoder_1/bahdanau_attention_1/Tanh", "StatefulPartitionedCall/functional_3_1/decoder_1/bahdanau_attention_1/dense_3_1/Cast/ReadVariableOp"], "attr": {"adj_x": {"b": false}, "grad_y": {"b": false}, "T": {"type": "DT_FLOAT"}, "grad_x": {"b": false}, "adj_y": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/bahdanau_attention_1/dense_3_1/Add", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_3_1/decoder_1/bahdanau_attention_1/dense_3_1/MatMul", "StatefulPartitionedCall/functional_3_1/decoder_1/bahdanau_attention_1/dense_3_1/Add/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/bahdanau_attention_1/transpose", "op": "Transpose", "input": ["StatefulPartitionedCall/functional_3_1/decoder_1/bahdanau_attention_1/dense_3_1/Add", "StatefulPartitionedCall/functional_3_1/decoder_1/bahdanau_attention_1/concat"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/bahdanau_attention_1/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/functional_3_1/decoder_1/bahdanau_attention_1/transpose"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/bahdanau_attention_1/transpose_1", "op": "Transpose", "input": ["StatefulPartitionedCall/functional_3_1/decoder_1/bahdanau_attention_1/Softmax", "StatefulPartitionedCall/functional_3_1/decoder_1/bahdanau_attention_1/concat_1"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/bahdanau_attention_1/mul", "op": "Mul", "input": ["StatefulPartitionedCall/functional_3_1/decoder_1/bahdanau_attention_1/transpose_1", "keras_tensor_23"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/bahdanau_attention_1/Sum", "op": "Sum", "input": ["StatefulPartitionedCall/functional_3_1/decoder_1/bahdanau_attention_1/mul", "StatefulPartitionedCall/functional_3_1/decoder_1/bahdanau_attention_1/Sum/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/functional_3_1/decoder_1/bahdanau_attention_1/Sum", "StatefulPartitionedCall/functional_3_1/decoder_1/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/functional_3_1/decoder_1/ExpandDims", "StatefulPartitionedCall/functional_3_1/decoder_1/embedding_1_1/GatherV2", "StatefulPartitionedCall/functional_3_1/decoder_1/concat/axis"], "attr": {"N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/functional_3_1/decoder_1/concat"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/transpose", "op": "Transpose", "input": ["StatefulPartitionedCall/functional_3_1/decoder_1/concat", "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/Shape", "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/strided_slice/stack", "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/strided_slice/stack_1", "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/transpose", "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"shape_type": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/zeros/packed", "op": "Pack", "input": ["StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/strided_slice", "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/zeros/packed/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/zeros", "op": "Fill", "input": ["StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/zeros/packed", "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/zeros/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/LoopControlInputs/_30", "op": "NoOp", "input": ["^StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/zeros", "^StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/TensorArrayUnstack/TensorListFromTensor", "^StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/TensorArrayV2_1"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/enter/_26", "op": "Enter", "input": ["StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/TensorArrayUnstack/TensorListFromTensor", "^StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/LoopControlInputs/_30"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZnVuY3Rpb25hbF8zXzEvZGVjb2Rlcl8xL2dydV8xXzEvd2hpbGU="}, "T": {"type": "DT_VARIANT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/enter/_22", "op": "Enter", "input": ["StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/Max", "^StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/LoopControlInputs/_30"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZnVuY3Rpb25hbF8zXzEvZGVjb2Rlcl8xL2dydV8xXzEvd2hpbGU="}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/enter/_24", "op": "Enter", "input": ["StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/TensorArrayV2_1", "^StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/LoopControlInputs/_30"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZnVuY3Rpb25hbF8zXzEvZGVjb2Rlcl8xL2dydV8xXzEvd2hpbGU="}, "T": {"type": "DT_VARIANT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/enter/_21", "op": "Enter", "input": ["StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/loop_counter", "^StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/LoopControlInputs/_30"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZnVuY3Rpb25hbF8zXzEvZGVjb2Rlcl8xL2dydV8xXzEvd2hpbGU="}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/enter/_25", "op": "Enter", "input": ["StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/zeros", "^StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/LoopControlInputs/_30"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZnVuY3Rpb25hbF8zXzEvZGVjb2Rlcl8xL2dydV8xXzEvd2hpbGU="}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/enter/_23", "op": "Enter", "input": ["StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/time", "^StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/LoopControlInputs/_30"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZnVuY3Rpb25hbF8zXzEvZGVjb2Rlcl8xL2dydV8xXzEvd2hpbGU="}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/enter/_27", "op": "Enter", "input": ["Func/StatefulPartitionedCall/input/_10", "^StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/LoopControlInputs/_30"], "attr": {"is_constant": {"b": true}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZnVuY3Rpb25hbF8zXzEvZGVjb2Rlcl8xL2dydV8xXzEvd2hpbGU="}, "T": {"type": "DT_FLOAT"}, "_has_manual_control_dependencies": {"b": true}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/enter/_28", "op": "Enter", "input": ["Func/StatefulPartitionedCall/input/_11", "^StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/LoopControlInputs/_30"], "attr": {"is_constant": {"b": true}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZnVuY3Rpb25hbF8zXzEvZGVjb2Rlcl8xL2dydV8xXzEvd2hpbGU="}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/enter/_29", "op": "Enter", "input": ["Func/StatefulPartitionedCall/input/_12", "^StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/LoopControlInputs/_30"], "attr": {"is_constant": {"b": true}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZnVuY3Rpb25hbF8zXzEvZGVjb2Rlcl8xL2dydV8xXzEvd2hpbGU="}, "T": {"type": "DT_FLOAT"}, "_has_manual_control_dependencies": {"b": true}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/merge/_36", "op": "Merge", "input": ["StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/enter/_26", "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/next_iteration/_57"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/merge/_32", "op": "Merge", "input": ["StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/enter/_22", "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/next_iteration/_53"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/merge/_34", "op": "Merge", "input": ["StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/enter/_24", "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/next_iteration/_55"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/merge/_31", "op": "Merge", "input": ["StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/enter/_21", "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/next_iteration/_52"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/merge/_35", "op": "Merge", "input": ["StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/enter/_25", "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/next_iteration/_56"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/merge/_33", "op": "Merge", "input": ["StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/enter/_23", "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/next_iteration/_54"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/cond/_19/input_control_node/_58", "op": "NoOp", "input": ["^StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/enter/_27", "^StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/enter/_28", "^StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/enter/_29", "^StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/merge/_31", "^StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/merge/_32", "^StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/merge/_33", "^StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/merge/_34", "^StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/merge/_35", "^StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/merge/_36"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/cond/_19/functional_3_1/decoder_1/gru_1_1/while/Less_1", "op": "Less", "input": ["StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/merge/_31", "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/merge/_32", "^Func/StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/cond/_19/input_control_node/_58"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/cond/_19/functional_3_1/decoder_1/gru_1_1/while/Less/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/cond/_19/input_control_node/_58"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/cond/_19/functional_3_1/decoder_1/gru_1_1/while/Less", "op": "Less", "input": ["StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/merge/_33", "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/cond/_19/functional_3_1/decoder_1/gru_1_1/while/Less/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/cond/_19/functional_3_1/decoder_1/gru_1_1/while/LogicalAnd", "op": "LogicalAnd", "input": ["StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/cond/_19/functional_3_1/decoder_1/gru_1_1/while/Less_1", "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/cond/_19/functional_3_1/decoder_1/gru_1_1/while/Less"]}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/LoopCond/_37", "op": "LoopCond", "input": ["StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/cond/_19/functional_3_1/decoder_1/gru_1_1/while/LogicalAnd"]}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/Max_switch/_39", "op": "Switch", "input": ["StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/merge/_32", "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/LoopCond/_37"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/TensorArrayV2_1_switch/_41", "op": "Switch", "input": ["StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/merge/_34", "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/LoopCond/_37"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/loop_counter_switch/_38", "op": "Switch", "input": ["StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/merge/_31", "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/LoopCond/_37"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/time_switch/_40", "op": "Switch", "input": ["StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/merge/_33", "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/LoopCond/_37"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/zeros_switch/_42", "op": "Switch", "input": ["StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/merge/_35", "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/LoopCond/_37"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/TensorArrayUnstack/TensorListFromTensor_switch/_43", "op": "Switch", "input": ["StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/merge/_36", "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/LoopCond/_37"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/exit/_46", "op": "Exit", "input": ["StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/Max_switch/_39"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/exit/_48", "op": "Exit", "input": ["StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/TensorArrayV2_1_switch/_41"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/exit/_45", "op": "Exit", "input": ["StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/loop_counter_switch/_38"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/loop_body_control/_44", "op": "Identity", "input": ["StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/loop_counter_switch/_38:1"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/exit/_47", "op": "Exit", "input": ["StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/time_switch/_40"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/exit/_49", "op": "Exit", "input": ["StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/zeros_switch/_42"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/exit/_50", "op": "Exit", "input": ["StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/TensorArrayUnstack/TensorListFromTensor_switch/_43"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/TensorArrayV2Stack/TensorListStack", "op": "TensorListStack", "input": ["StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/exit/_48", "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/TensorArrayV2Stack/TensorListStack/element_shape"], "attr": {"num_elements": {"i": "1"}, "element_dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/body/_20/input_control_node/_69", "op": "NoOp", "input": ["^StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/Max_switch/_39", "^StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/TensorArrayUnstack/TensorListFromTensor_switch/_43", "^StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/TensorArrayV2_1_switch/_41", "^StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/time_switch/_40", "^StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/loop_body_control/_44", "^StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/zeros_switch/_42", "^StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/enter/_27", "^StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/enter/_28", "^StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/enter/_29"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/LoopExecuted/_51", "op": "NoOp", "input": ["^StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/exit/_45", "^StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/exit/_46", "^StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/exit/_47", "^StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/exit/_48", "^StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/exit/_49", "^StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/exit/_50"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/transpose_1", "op": "Transpose", "input": ["StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/TensorArrayV2Stack/TensorListStack", "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/transpose_1/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/body/_20/functional_3_1/decoder_1/gru_1_1/while/add_1/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/body/_20/input_control_node/_69"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/body/_20/functional_3_1/decoder_1/gru_1_1/while/gru_cell_1/sub/x", "op": "Const", "input": ["^Func/StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/body/_20/input_control_node/_69"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/body/_20/functional_3_1/decoder_1/gru_1_1/while/gru_cell_1/strided_slice/stack", "op": "Const", "input": ["^Func/StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/body/_20/input_control_node/_69"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/body/_20/functional_3_1/decoder_1/gru_1_1/while/gru_cell_1/strided_slice/stack_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/body/_20/input_control_node/_69"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/body/_20/functional_3_1/decoder_1/gru_1_1/while/gru_cell_1/strided_slice/stack_2", "op": "Const", "input": ["^Func/StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/body/_20/input_control_node/_69"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/body/_20/functional_3_1/decoder_1/gru_1_1/while/gru_cell_1/split_1/split_dim", "op": "Const", "input": ["^Func/StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/body/_20/input_control_node/_69"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/body/_20/functional_3_1/decoder_1/gru_1_1/while/add/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/body/_20/input_control_node/_69"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/body/_20/input/_72", "op": "Identity", "input": ["StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/time_switch/_40:1", "^Func/StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/body/_20/input_control_node/_69"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/body/_20/functional_3_1/decoder_1/gru_1_1/while/TensorArrayV2Read/TensorListGetItem/element_shape", "op": "Const", "input": ["^Func/StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/body/_20/input_control_node/_69"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/body/_20/functional_3_1/decoder_1/gru_1_1/while/gru_cell_1/Squeeze", "op": "Const", "input": ["^Func/StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/body/_20/input_control_node/_69", "^StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/enter/_27"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1536"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/body/_20/functional_3_1/decoder_1/gru_1_1/while/gru_cell_1/strided_slice_1/stack", "op": "Const", "input": ["^Func/StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/body/_20/input_control_node/_69"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/body/_20/functional_3_1/decoder_1/gru_1_1/while/gru_cell_1/strided_slice_1/stack_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/body/_20/input_control_node/_69"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/body/_20/functional_3_1/decoder_1/gru_1_1/while/gru_cell_1/strided_slice_1/stack_2", "op": "Const", "input": ["^Func/StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/body/_20/input_control_node/_69"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/body/_20/functional_3_1/decoder_1/gru_1_1/while/gru_cell_1/Squeeze_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/body/_20/input_control_node/_69", "^StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/enter/_27"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1536"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/body/_20/functional_3_1/decoder_1/gru_1_1/while/gru_cell_1/strided_slice_2/stack", "op": "Const", "input": ["^Func/StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/body/_20/input_control_node/_69"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/body/_20/functional_3_1/decoder_1/gru_1_1/while/gru_cell_1/strided_slice_2/stack_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/body/_20/input_control_node/_69"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/body/_20/functional_3_1/decoder_1/gru_1_1/while/gru_cell_1/strided_slice_2/stack_2", "op": "Const", "input": ["^Func/StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/body/_20/input_control_node/_69"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/body/_20/functional_3_1/decoder_1/gru_1_1/while/gru_cell_1/Cast/ReadVariableOp", "op": "Const", "input": ["^StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/enter/_28", "^Func/StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/body/_20/input_control_node/_69"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "768"}, {"size": "1536"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/body/_20/functional_3_1/decoder_1/gru_1_1/while/gru_cell_1/Cast_1/ReadVariableOp", "op": "Const", "input": ["^StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/enter/_29", "^Func/StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/body/_20/input_control_node/_69"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "1536"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Identity_1", "op": "Identity", "input": ["StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/exit/_49", "^StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/LoopExecuted/_51"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity_2", "op": "Identity", "input": ["StatefulPartitionedCall/functional_3_1/decoder_1/bahdanau_attention_1/transpose_1", "^StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/LoopExecuted/_51"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/transpose_1", "StatefulPartitionedCall/functional_3_1/decoder_1/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/body/_20/functional_3_1/decoder_1/gru_1_1/while/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/loop_counter_switch/_38:1", "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/body/_20/functional_3_1/decoder_1/gru_1_1/while/add_1/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/body/_20/functional_3_1/decoder_1/gru_1_1/while/add", "op": "AddV2", "input": ["Func/StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/body/_20/input/_72", "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/body/_20/functional_3_1/decoder_1/gru_1_1/while/add/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/body/_20/functional_3_1/decoder_1/gru_1_1/while/TensorArrayV2Read/TensorListGetItem", "op": "TensorListGetItem", "input": ["StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/TensorArrayUnstack/TensorListFromTensor_switch/_43:1", "Func/StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/body/_20/input/_72", "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/body/_20/functional_3_1/decoder_1/gru_1_1/while/TensorArrayV2Read/TensorListGetItem/element_shape"], "attr": {"element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/body/_20/functional_3_1/decoder_1/gru_1_1/while/gru_cell_1/add_1", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/zeros_switch/_42:1", "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/body/_20/functional_3_1/decoder_1/gru_1_1/while/gru_cell_1/Cast_1/ReadVariableOp", "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/body/_20/functional_3_1/decoder_1/gru_1_1/while/gru_cell_1/Squeeze_1"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/body/_20/output_control_node/_88", "op": "NoOp", "input": ["^StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/body/_20/functional_3_1/decoder_1/gru_1_1/while/gru_cell_1/Cast/ReadVariableOp", "^StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/body/_20/functional_3_1/decoder_1/gru_1_1/while/gru_cell_1/Cast_1/ReadVariableOp", "^StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/enter/_27"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/body/_20/functional_3_1/decoder_1/gru_1_1/while/NoOp", "op": "NoOp", "input": ["^StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/body/_20/functional_3_1/decoder_1/gru_1_1/while/gru_cell_1/Cast/ReadVariableOp", "^StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/body/_20/functional_3_1/decoder_1/gru_1_1/while/gru_cell_1/Cast_1/ReadVariableOp", "^StatefulPartitionedCall/functional_3_1/decoder_1/gru_1_1/while/enter/_27"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/functional_3_1/decoder_1/dense_1/Add", "op": "_FusedMatMul", "input": 