{"format": "graph-model", "generatedBy": "2.18.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"encoder_inputs:0": {"name": "encoder_inputs:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}]}}, "decoder_inputs:0": {"name": "decoder_inputs:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "10000"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/functional_4_1/lstm_9_1/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_4_1/lstm_8_1/zeros/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_4_1/lstm_8_1/zeros/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_4_1/lstm_8_1/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_4_1/embedding_8_1/GatherV2/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10000"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_4_1/embedding_8_1/Less/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_4_1/embedding_8_1/strided_slice", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_4_1/embedding_8_1/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_4_1/lstm_8_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_4_1/lstm_8_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_4_1/lstm_8_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_4_1/lstm_8_1/zeros_1/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_4_1/lstm_8_1/zeros_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_4_1/lstm_8_1/ExpandDims_1/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_4_1/lstm_8_1/concat_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1576960"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_4_1/Cast_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_4_1/lstm_8_1/Sum_1/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_4_1/lstm_9_1/ExpandDims_1/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_4_1/lstm_9_1/concat_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1576960"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_4_1/lstm_9_1/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_4_1/lstm_9_1/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_4_1/lstm_9_1/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_4_1/embedding_9_1/GatherV2/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10000"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_4_1/embedding_9_1/Less/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_4_1/embedding_9_1/strided_slice", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_4_1/embedding_9_1/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_4_1/lstm_9_1/strided_slice_2/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_4_1/lstm_9_1/strided_slice_2/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_4_1/lstm_9_1/strided_slice_2/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_4_1/decoder_outputs_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "10000"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_4_1/decoder_outputs_1/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10000"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "decoder_inputs", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "encoder_inputs", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_4_1/embedding_9_1/Cast", "op": "Cast", "input": ["decoder_inputs"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_INT32"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_4_1/embedding_8_1/Cast", "op": "Cast", "input": ["encoder_inputs"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_INT32"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_4_1/NotEqual_1", "op": "NotEqual", "input": ["encoder_inputs", "StatefulPartitionedCall/functional_4_1/Cast_1"], "attr": {"T": {"type": "DT_FLOAT"}, "incompatible_shape_error": {"b": true}}}, {"name": "StatefulPartitionedCall/functional_4_1/embedding_9_1/Less", "op": "Less", "input": ["StatefulPartitionedCall/functional_4_1/embedding_9_1/Cast", "StatefulPartitionedCall/functional_4_1/embedding_9_1/Less/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_4_1/embedding_9_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_4_1/embedding_9_1/Cast", "StatefulPartitionedCall/functional_4_1/embedding_9_1/strided_slice"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_4_1/embedding_8_1/Less", "op": "Less", "input": ["StatefulPartitionedCall/functional_4_1/embedding_8_1/Cast", "StatefulPartitionedCall/functional_4_1/embedding_8_1/Less/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_4_1/embedding_8_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_4_1/embedding_8_1/Cast", "StatefulPartitionedCall/functional_4_1/embedding_8_1/strided_slice"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_4_1/lstm_8_1/Cast_1", "op": "Cast", "input": ["StatefulPartitionedCall/functional_4_1/NotEqual_1"], "attr": {"SrcT": {"type": "DT_BOOL"}, "DstT": {"type": "DT_INT32"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_4_1/embedding_9_1/SelectV2", "op": "SelectV2", "input": ["StatefulPartitionedCall/functional_4_1/embedding_9_1/Less", "StatefulPartitionedCall/functional_4_1/embedding_9_1/add", "StatefulPartitionedCall/functional_4_1/embedding_9_1/Cast"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_4_1/embedding_8_1/SelectV2", "op": "SelectV2", "input": ["StatefulPartitionedCall/functional_4_1/embedding_8_1/Less", "StatefulPartitionedCall/functional_4_1/embedding_8_1/add", "StatefulPartitionedCall/functional_4_1/embedding_8_1/Cast"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_4_1/lstm_8_1/Sum_1", "op": "Sum", "input": ["StatefulPartitionedCall/functional_4_1/lstm_8_1/Cast_1", "StatefulPartitionedCall/functional_4_1/lstm_8_1/Sum_1/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_4_1/embedding_9_1/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/functional_4_1/embedding_9_1/GatherV2/ReadVariableOp", "StatefulPartitionedCall/functional_4_1/embedding_9_1/SelectV2", "StatefulPartitionedCall/functional_4_1/embedding_9_1/GatherV2/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "Tparams": {"type": "DT_FLOAT"}, "Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/functional_4_1/embedding_8_1/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/functional_4_1/embedding_8_1/GatherV2/ReadVariableOp", "StatefulPartitionedCall/functional_4_1/embedding_8_1/SelectV2", "StatefulPartitionedCall/functional_4_1/embedding_8_1/GatherV2/axis"], "attr": {"Tparams": {"type": "DT_FLOAT"}, "Taxis": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/functional_4_1/lstm_9_1/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/functional_4_1/embedding_9_1/GatherV2"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/functional_4_1/lstm_9_1/Shape_1", "op": "Shape", "input": ["StatefulPartitionedCall/functional_4_1/embedding_9_1/GatherV2"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/functional_4_1/lstm_8_1/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/functional_4_1/embedding_8_1/GatherV2"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/functional_4_1/lstm_9_1/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/functional_4_1/lstm_9_1/Shape", "StatefulPartitionedCall/functional_4_1/lstm_9_1/strided_slice_1/stack", "StatefulPartitionedCall/functional_4_1/lstm_9_1/strided_slice_1/stack_1", "StatefulPartitionedCall/functional_4_1/lstm_9_1/strided_slice_1/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/functional_4_1/lstm_9_1/strided_slice_2", "op": "StridedSlice", "input": ["StatefulPartitionedCall/functional_4_1/lstm_9_1/Shape_1", "StatefulPartitionedCall/functional_4_1/lstm_9_1/strided_slice_2/stack", "StatefulPartitionedCall/functional_4_1/lstm_9_1/strided_slice_2/stack_1", "StatefulPartitionedCall/functional_4_1/lstm_9_1/strided_slice_2/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/functional_4_1/lstm_8_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/functional_4_1/lstm_8_1/Shape", "StatefulPartitionedCall/functional_4_1/lstm_8_1/strided_slice/stack", "StatefulPartitionedCall/functional_4_1/lstm_8_1/strided_slice/stack_1", "StatefulPartitionedCall/functional_4_1/lstm_8_1/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/functional_4_1/lstm_9_1/Fill/dims_const_axis", "op": "Const", "input": ["^StatefulPartitionedCall/functional_4_1/lstm_9_1/strided_slice_1"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_4_1/lstm_8_1/zeros/packed", "op": "Pack", "input": ["StatefulPartitionedCall/functional_4_1/lstm_8_1/strided_slice", "StatefulPartitionedCall/functional_4_1/lstm_8_1/zeros/packed/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_4_1/lstm_8_1/zeros_1/packed", "op": "Pack", "input": ["StatefulPartitionedCall/functional_4_1/lstm_8_1/strided_slice", "StatefulPartitionedCall/functional_4_1/lstm_8_1/zeros_1/packed/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_4_1/lstm_9_1/Fill/dims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/functional_4_1/lstm_9_1/strided_slice_1", "ConstantFolding/StatefulPartitionedCall/functional_4_1/lstm_9_1/Fill/dims_const_axis"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_4_1/lstm_8_1/zeros", "op": "Fill", "input": ["StatefulPartitionedCall/functional_4_1/lstm_8_1/zeros/packed", "StatefulPartitionedCall/functional_4_1/lstm_8_1/zeros/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_4_1/lstm_8_1/zeros_1", "op": "Fill", "input": ["StatefulPartitionedCall/functional_4_1/lstm_8_1/zeros_1/packed", "StatefulPartitionedCall/functional_4_1/lstm_8_1/zeros_1/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_4_1/lstm_9_1/Fill", "op": "Fill", "input": ["StatefulPartitionedCall/functional_4_1/lstm_9_1/Fill/dims", "StatefulPartitionedCall/functional_4_1/lstm_9_1/strided_slice_2"], "attr": {"T": {"type": "DT_INT32"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_4_1/lstm_8_1/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/functional_4_1/lstm_8_1/zeros", "StatefulPartitionedCall/functional_4_1/lstm_8_1/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_4_1/lstm_8_1/ExpandDims_1", "op": "ExpandDims", "input": ["StatefulPartitionedCall/functional_4_1/lstm_8_1/zeros_1", "StatefulPartitionedCall/functional_4_1/lstm_8_1/ExpandDims_1/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_4_1/lstm_8_1/CudnnRNNV3", "op": "CudnnRNNV3", "input": ["StatefulPartitionedCall/functional_4_1/embedding_8_1/GatherV2", "StatefulPartitionedCall/functional_4_1/lstm_8_1/ExpandDims", "StatefulPartitionedCall/functional_4_1/lstm_8_1/ExpandDims_1", "StatefulPartitionedCall/functional_4_1/lstm_8_1/concat_1", "StatefulPartitionedCall/functional_4_1/lstm_8_1/Sum_1"], "attr": {"T": {"type": "DT_FLOAT"}, "dropout": {"f": 0.0}, "direction": {"s": "dW5pZGlyZWN0aW9uYWw="}, "rnn_mode": {"s": "bHN0bQ=="}, "seed2": {"i": "0"}, "is_training": {"b": true}, "time_major": {"b": false}, "input_mode": {"s": "bGluZWFyX2lucHV0"}, "num_proj": {"i": "0"}, "seed": {"i": "0"}}}, {"name": "StatefulPartitionedCall/functional_4_1/lstm_8_1/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/functional_4_1/lstm_8_1/CudnnRNNV3:1"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["1"]}}}}, {"name": "StatefulPartitionedCall/functional_4_1/lstm_8_1/Squeeze_1", "op": "Squeeze", "input": ["StatefulPartitionedCall/functional_4_1/lstm_8_1/CudnnRNNV3:2"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["1"]}}}}, {"name": "StatefulPartitionedCall/functional_4_1/lstm_9_1/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/functional_4_1/lstm_8_1/Squeeze", "StatefulPartitionedCall/functional_4_1/lstm_9_1/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_4_1/lstm_9_1/ExpandDims_1", "op": "ExpandDims", "input": ["StatefulPartitionedCall/functional_4_1/lstm_8_1/Squeeze_1", "StatefulPartitionedCall/functional_4_1/lstm_9_1/ExpandDims_1/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_4_1/lstm_9_1/CudnnRNNV3", "op": "CudnnRNNV3", "input": ["StatefulPartitionedCall/functional_4_1/embedding_9_1/GatherV2", "StatefulPartitionedCall/functional_4_1/lstm_9_1/ExpandDims", "StatefulPartitionedCall/functional_4_1/lstm_9_1/ExpandDims_1", "StatefulPartitionedCall/functional_4_1/lstm_9_1/concat_1", "StatefulPartitionedCall/functional_4_1/lstm_9_1/Fill"], "attr": {"seed": {"i": "0"}, "dropout": {"f": 0.0}, "is_training": {"b": true}, "rnn_mode": {"s": "bHN0bQ=="}, "seed2": {"i": "0"}, "direction": {"s": "dW5pZGlyZWN0aW9uYWw="}, "T": {"type": "DT_FLOAT"}, "input_mode": {"s": "bGluZWFyX2lucHV0"}, "num_proj": {"i": "0"}, "time_major": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_4_1/decoder_outputs_1/MatMul", "op": "BatchMatMulV2", "input": ["StatefulPartitionedCall/functional_4_1/lstm_9_1/CudnnRNNV3", "StatefulPartitionedCall/functional_4_1/decoder_outputs_1/Cast/ReadVariableOp"], "attr": {"grad_y": {"b": false}, "adj_x": {"b": false}, "T": {"type": "DT_FLOAT"}, "grad_x": {"b": false}, "adj_y": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_4_1/decoder_outputs_1/Add", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_4_1/decoder_outputs_1/MatMul", "StatefulPartitionedCall/functional_4_1/decoder_outputs_1/Add/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_4_1/decoder_outputs_1/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/functional_4_1/decoder_outputs_1/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/functional_4_1/decoder_outputs_1/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1994}}, "weightsManifest": [{"paths": ["group1-shard1of13.bin", "group1-shard2of13.bin", "group1-shard3of13.bin", "group1-shard4of13.bin", "group1-shard5of13.bin", "group1-shard6of13.bin", "group1-shard7of13.bin", "group1-shard8of13.bin", "group1-shard9of13.bin", "group1-shard10of13.bin", "group1-shard11of13.bin", "group1-shard12of13.bin", "group1-shard13of13.bin"], "weights": [{"name": "StatefulPartitionedCall/functional_4_1/lstm_9_1/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_4_1/lstm_8_1/zeros/packed/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_4_1/lstm_8_1/zeros/Const", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_4_1/lstm_8_1/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_4_1/embedding_8_1/GatherV2/ReadVariableOp", "shape": [10000, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_4_1/embedding_8_1/Less/y", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_4_1/embedding_8_1/strided_slice", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_4_1/embedding_8_1/GatherV2/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_4_1/lstm_8_1/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_4_1/lstm_8_1/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_4_1/lstm_8_1/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_4_1/lstm_8_1/zeros_1/packed/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_4_1/lstm_8_1/zeros_1/Const", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_4_1/lstm_8_1/ExpandDims_1/dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_4_1/lstm_8_1/concat_1", "shape": [1576960], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_4_1/Cast_1", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_4_1/lstm_8_1/Sum_1/reduction_indices", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_4_1/lstm_9_1/ExpandDims_1/dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_4_1/lstm_9_1/concat_1", "shape": [1576960], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_4_1/lstm_9_1/strided_slice_1/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_4_1/lstm_9_1/strided_slice_1/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_4_1/lstm_9_1/strided_slice_1/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_4_1/embedding_9_1/GatherV2/ReadVariableOp", "shape": [10000, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_4_1/embedding_9_1/Less/y", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_4_1/embedding_9_1/strided_slice", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_4_1/embedding_9_1/GatherV2/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_4_1/lstm_9_1/strided_slice_2/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_4_1/lstm_9_1/strided_slice_2/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_4_1/lstm_9_1/strided_slice_2/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_4_1/decoder_outputs_1/Cast/ReadVariableOp", "shape": [512, 10000], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_4_1/decoder_outputs_1/Add/ReadVariableOp", "shape": [10000], "dtype": "float32"}, {"name": "ConstantFolding/StatefulPartitionedCall/functional_4_1/lstm_9_1/Fill/dims_const_axis", "shape": [], "dtype": "int32"}]}]}