{
    "format": "graph-model",
    "generatedBy": "2.18.0",
    "convertedBy": "TensorFlow.js Converter v4.22.0",
    "signature": {
        "inputs": {
            "keras_tensor_93": {
                "name": "keras_tensor_93:0",
                "dtype": "DT_FLOAT",
                "tensorShape": {
                    "dim": [
                        {
                            "size": "-1"
                        },
                        {
                            "size": "5"
                        }
                    ]
                }
            },
            "keras_tensor_88": {
                "name": "keras_tensor_88:0",
                "dtype": "DT_FLOAT",
                "tensorShape": {
                    "dim": [
                        {
                            "size": "-1"
                        },
                        {
                            "size": "2"
                        }
                    ]
                }
            }
        },
        "outputs": {
            "output_0": {
                "name": "Identity:0",
                "dtype": "DT_FLOAT",
                "tensorShape": {
                    "dim": [
                        {
                            "size": "-1"
                        },
                        {
                            "size": "5"
                        },
                        {
                            "size": "11"
                        }
                    ]
                }
            }
        }
    },
    "modelTopology": {
        "node": [
            {
                "name": "StatefulPartitionedCall/functional_8_1/lstm_17_1/TensorArrayV2Stack/TensorListStack/element_shape",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "2"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/functional_8_1/lstm_17_1/transpose_1/perm",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "3"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/functional_8_1/dense_8_1/Cast/ReadVariableOp",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "256"
                                    },
                                    {
                                        "size": "11"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/functional_8_1/dense_8_1/Add/ReadVariableOp",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "11"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/functional_8_1/lstm_17_1/Max",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {}
                        }
                    },
                    "dtype": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/functional_8_1/lstm_17_1/time",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {}
                        }
                    },
                    "_has_manual_control_dependencies": {
                        "b": true
                    },
                    "dtype": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/functional_8_1/lstm_17_1/while/loop_counter",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {}
                        }
                    },
                    "_has_manual_control_dependencies": {
                        "b": true
                    },
                    "dtype": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "Func/StatefulPartitionedCall/input/_7",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "128"
                                    },
                                    {
                                        "size": "1024"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "Func/StatefulPartitionedCall/input/_8",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "256"
                                    },
                                    {
                                        "size": "1024"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "Func/StatefulPartitionedCall/input/_9",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "1024"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/functional_8_1/lstm_17_1/TensorArrayV2_1/element_shape",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "2"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/functional_8_1/lstm_17_1/TensorArrayV2_1/num_elements",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {}
                        }
                    },
                    "dtype": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/functional_8_1/embedding_17_1/GatherV2/ReadVariableOp",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "11"
                                    },
                                    {
                                        "size": "128"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/functional_8_1/embedding_17_1/Less/y",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {}
                        }
                    },
                    "dtype": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/functional_8_1/embedding_17_1/strided_slice",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {}
                        }
                    },
                    "dtype": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/functional_8_1/embedding_17_1/GatherV2/axis",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {}
                        }
                    },
                    "dtype": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/functional_8_1/lstm_17_1/transpose/perm",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "3"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/functional_8_1/lstm_17_1/TensorArrayUnstack/TensorListFromTensor/element_shape",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "2"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/functional_8_1/lstm_16_1/Max",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {}
                        }
                    },
                    "dtype": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/functional_8_1/lstm_16_1/while/loop_counter",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {}
                        }
                    },
                    "_has_manual_control_dependencies": {
                        "b": true
                    },
                    "dtype": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/functional_8_1/lstm_16_1/time",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {}
                        }
                    },
                    "_has_manual_control_dependencies": {
                        "b": true
                    },
                    "dtype": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "Func/StatefulPartitionedCall/input/_4",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "128"
                                    },
                                    {
                                        "size": "1024"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "Func/StatefulPartitionedCall/input/_5",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "256"
                                    },
                                    {
                                        "size": "1024"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "Func/StatefulPartitionedCall/input/_6",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "1024"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/functional_8_1/lstm_16_1/transpose/perm",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "3"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/functional_8_1/lstm_16_1/TensorArrayUnstack/TensorListFromTensor/element_shape",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "2"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/functional_8_1/lstm_16_1/TensorArrayV2_1/element_shape",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "2"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/functional_8_1/lstm_16_1/TensorArrayV2_1/num_elements",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {}
                        }
                    },
                    "dtype": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/functional_8_1/lstm_16_1/zeros/packed/1",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {}
                        }
                    },
                    "dtype": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/functional_8_1/lstm_16_1/zeros/Const",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {}
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/functional_8_1/embedding_16_1/GatherV2/ReadVariableOp",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "7"
                                    },
                                    {
                                        "size": "128"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/functional_8_1/embedding_16_1/Less/y",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {}
                        }
                    },
                    "dtype": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/functional_8_1/embedding_16_1/strided_slice",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {}
                        }
                    },
                    "dtype": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/functional_8_1/embedding_16_1/GatherV2/axis",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {}
                        }
                    },
                    "dtype": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/functional_8_1/lstm_16_1/strided_slice/stack",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "1"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/functional_8_1/lstm_16_1/strided_slice/stack_1",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "1"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/functional_8_1/lstm_16_1/strided_slice/stack_2",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "1"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/functional_8_1/lstm_16_1/zeros_1/packed/1",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {}
                        }
                    },
                    "dtype": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/functional_8_1/lstm_16_1/zeros_1/Const",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {}
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "keras_tensor_88",
                "op": "Placeholder",
                "attr": {
                    "shape": {
                        "shape": {
                            "dim": [
                                {
                                    "size": "-1"
                                },
                                {
                                    "size": "2"
                                }
                            ]
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "keras_tensor_93",
                "op": "Placeholder",
                "attr": {
                    "shape": {
                        "shape": {
                            "dim": [
                                {
                                    "size": "-1"
                                },
                                {
                                    "size": "5"
                                }
                            ]
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/functional_8_1/lstm_17_1/TensorArrayV2_1",
                "op": "TensorListReserve",
                "input": [
                    "StatefulPartitionedCall/functional_8_1/lstm_17_1/TensorArrayV2_1/element_shape",
                    "StatefulPartitionedCall/functional_8_1/lstm_17_1/TensorArrayV2_1/num_elements"
                ],
                "attr": {
                    "shape_type": {
                        "type": "DT_INT32"
                    },
                    "element_dtype": {
                        "type": "DT_FLOAT"
                    }
                },
                "experimentalType": {
                    "typeId": "TFT_PRODUCT",
                    "args": [
                        {
                            "typeId": "TFT_ARRAY",
                            "args": [
                                {
                                    "typeId": "TFT_TENSOR",
                                    "args": [
                                        {
                                            "typeId": "TFT_FLOAT"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            },
            {
                "name": "StatefulPartitionedCall/functional_8_1/lstm_16_1/TensorArrayV2_1",
                "op": "TensorListReserve",
                "input": [
                    "StatefulPartitionedCall/functional_8_1/lstm_16_1/TensorArrayV2_1/element_shape",
                    "StatefulPartitionedCall/functional_8_1/lstm_16_1/TensorArrayV2_1/num_elements"
                ],
                "attr": {
                    "shape_type": {
                        "type": "DT_INT32"
                    },
                    "element_dtype": {
                        "type": "DT_FLOAT"
                    }
                },
                "experimentalType": {
                    "typeId": "TFT_PRODUCT",
                    "args": [
                        {
                            "typeId": "TFT_ARRAY",
                            "args": [
                                {
                                    "typeId": "TFT_TENSOR",
                                    "args": [
                                        {
                                            "typeId": "TFT_FLOAT"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            },
            {
                "name": "StatefulPartitionedCall/functional_8_1/embedding_16_1/Cast",
                "op": "Cast",
                "input": [
                    "keras_tensor_88"
                ],
                "attr": {
                    "SrcT": {
                        "type": "DT_FLOAT"
                    },
                    "DstT": {
                        "type": "DT_INT32"
                    },
                    "Truncate": {
                        "b": false
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/functional_8_1/embedding_17_1/Cast",
                "op": "Cast",
                "input": [
                    "keras_tensor_93"
                ],
                "attr": {
                    "SrcT": {
                        "type": "DT_FLOAT"
                    },
                    "DstT": {
                        "type": "DT_INT32"
                    },
                    "Truncate": {
                        "b": false
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/functional_8_1/embedding_16_1/Less",
                "op": "Less",
                "input": [
                    "StatefulPartitionedCall/functional_8_1/embedding_16_1/Cast",
                    "StatefulPartitionedCall/functional_8_1/embedding_16_1/Less/y"
                ],
                "attr": {
                    "T": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/functional_8_1/embedding_16_1/add",
                "op": "AddV2",
                "input": [
                    "StatefulPartitionedCall/functional_8_1/embedding_16_1/Cast",
                    "StatefulPartitionedCall/functional_8_1/embedding_16_1/strided_slice"
                ],
                "attr": {
                    "T": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/functional_8_1/embedding_17_1/Less",
                "op": "Less",
                "input": [
                    "StatefulPartitionedCall/functional_8_1/embedding_17_1/Cast",
                    "StatefulPartitionedCall/functional_8_1/embedding_17_1/Less/y"
                ],
                "attr": {
                    "T": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/functional_8_1/embedding_17_1/add",
                "op": "AddV2",
                "input": [
                    "StatefulPartitionedCall/functional_8_1/embedding_17_1/Cast",
                    "StatefulPartitionedCall/functional_8_1/embedding_17_1/strided_slice"
                ],
                "attr": {
                    "T": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/functional_8_1/embedding_16_1/SelectV2",
                "op": "SelectV2",
                "input": [
                    "StatefulPartitionedCall/functional_8_1/embedding_16_1/Less",
                    "StatefulPartitionedCall/functional_8_1/embedding_16_1/add",
                    "StatefulPartitionedCall/functional_8_1/embedding_16_1/Cast"
                ],
                "attr": {
                    "T": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/functional_8_1/embedding_17_1/SelectV2",
                "op": "SelectV2",
                "input": [
                    "StatefulPartitionedCall/functional_8_1/embedding_17_1/Less",
                    "StatefulPartitionedCall/functional_8_1/embedding_17_1/add",
                    "StatefulPartitionedCall/functional_8_1/embedding_17_1/Cast"
                ],
                "attr": {
                    "T": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/functional_8_1/embedding_16_1/GatherV2",
                "op": "GatherV2",
                "input": [
                    "StatefulPartitionedCall/functional_8_1/embedding_16_1/GatherV2/ReadVariableOp",
                    "StatefulPartitionedCall/functional_8_1/embedding_16_1/SelectV2",
                    "StatefulPartitionedCall/functional_8_1/embedding_16_1/GatherV2/axis"
                ],
                "attr": {
                    "Taxis": {
                        "type": "DT_INT32"
                    },
                    "Tparams": {
                        "type": "DT_FLOAT"
                    },
                    "Tindices": {
                        "type": "DT_INT32"
                    },
                    "batch_dims": {
                        "i": "0"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/functional_8_1/embedding_17_1/GatherV2",
                "op": "GatherV2",
                "input": [
                    "StatefulPartitionedCall/functional_8_1/embedding_17_1/GatherV2/ReadVariableOp",
                    "StatefulPartitionedCall/functional_8_1/embedding_17_1/SelectV2",
                    "StatefulPartitionedCall/functional_8_1/embedding_17_1/GatherV2/axis"
                ],
                "attr": {
                    "Taxis": {
                        "type": "DT_INT32"
                    },
                    "Tparams": {
                        "type": "DT_FLOAT"
                    },
                    "Tindices": {
                        "type": "DT_INT32"
                    },
                    "batch_dims": {
                        "i": "0"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/functional_8_1/lstm_16_1/transpose",
                "op": "Transpose",
                "input": [
                    "StatefulPartitionedCall/functional_8_1/embedding_16_1/GatherV2",
                    "StatefulPartitionedCall/functional_8_1/lstm_16_1/transpose/perm"
                ],
                "attr": {
                    "Tperm": {
                        "type": "DT_INT32"
                    },
                    "T": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/functional_8_1/lstm_16_1/Shape",
                "op": "Shape",
                "input": [
                    "StatefulPartitionedCall/functional_8_1/embedding_16_1/GatherV2"
                ],
                "attr": {
                    "T": {
                        "type": "DT_FLOAT"
                    },
                    "out_type": {
                        "type": "DT_INT32"
                    }
                },
                "experimentalType": {
                    "typeId": "TFT_PRODUCT",
                    "args": [
                        {
                            "typeId": "TFT_SHAPE_TENSOR",
                            "args": [
                                {
                                    "typeId": "TFT_INT32"
                                }
                            ]
                        }
                    ]
                }
            },
            {
                "name": "StatefulPartitionedCall/functional_8_1/lstm_17_1/transpose",
                "op": "Transpose",
                "input": [
                    "StatefulPartitionedCall/functional_8_1/embedding_17_1/GatherV2",
                    "StatefulPartitionedCall/functional_8_1/lstm_17_1/transpose/perm"
                ],
                "attr": {
                    "Tperm": {
                        "type": "DT_INT32"
                    },
                    "T": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/functional_8_1/lstm_16_1/TensorArrayUnstack/TensorListFromTensor",
                "op": "TensorListFromTensor",
                "input": [
                    "StatefulPartitionedCall/functional_8_1/lstm_16_1/transpose",
                    "StatefulPartitionedCall/functional_8_1/lstm_16_1/TensorArrayUnstack/TensorListFromTensor/element_shape"
                ],
                "attr": {
                    "shape_type": {
                        "type": "DT_INT32"
                    },
                    "element_dtype": {
                        "type": "DT_FLOAT"
                    }
                },
                "experimentalType": {
                    "typeId": "TFT_PRODUCT",
                    "args": [
                        {
                            "typeId": "TFT_ARRAY",
                            "args": [
                                {
                                    "typeId": "TFT_TENSOR",
                                    "args": [
                                        {
                                            "typeId": "TFT_FLOAT"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            },
            {
                "name": "StatefulPartitionedCall/functional_8_1/lstm_16_1/strided_slice",
                "op": "StridedSlice",
                "input": [
                    "StatefulPartitionedCall/functional_8_1/lstm_16_1/Shape",
                    "StatefulPartitionedCall/functional_8_1/lstm_16_1/strided_slice/stack",
                    "StatefulPartitionedCall/functional_8_1/lstm_16_1/strided_slice/stack_1",
                    "StatefulPartitionedCall/functional_8_1/lstm_16_1/strided_slice/stack_2"
                ],
                "attr": {
                    "shrink_axis_mask": {
                        "i": "1"
                    },
                    "Index": {
                        "type": "DT_INT32"
                    },
                    "new_axis_mask": {
                        "i": "0"
                    },
                    "begin_mask": {
                        "i": "0"
                    },
                    "T": {
                        "type": "DT_INT32"
                    },
                    "end_mask": {
                        "i": "0"
                    },
                    "ellipsis_mask": {
                        "i": "0"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/functional_8_1/lstm_17_1/TensorArrayUnstack/TensorListFromTensor",
                "op": "TensorListFromTensor",
                "input": [
                    "StatefulPartitionedCall/functional_8_1/lstm_17_1/transpose",
                    "StatefulPartitionedCall/functional_8_1/lstm_17_1/TensorArrayUnstack/TensorListFromTensor/element_shape"
                ],
                "attr": {
                    "shape_type": {
                        "type": "DT_INT32"
                    },
                    "_has_manual_control_dependencies": {
                        "b": true
                    },
                    "element_dtype": {
                        "type": "DT_FLOAT"
                    }
                },
                "experimentalType": {
                    "typeId": "TFT_PRODUCT",
                    "args": [
                        {
                            "typeId": "TFT_ARRAY",
                            "args": [
                                {
                                    "typeId": "TFT_TENSOR",
                                    "args": [
                                        {
                                            "typeId": "TFT_FLOAT"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            },
            {
                "name": "StatefulPartitionedCall/functional_8_1/lstm_16_1/zeros/packed",
                "op": "Pack",
                "input": [
                    "StatefulPartitionedCall/functional_8_1/lstm_16_1/strided_slice",
                    "StatefulPartitionedCall/functional_8_1/lstm_16_1/zeros/packed/1"
                ],
                "attr": {
                    "N": {
                        "i": "2"
                    },
                    "axis": {
                        "i": "0"
                    },
                    "T": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/functional_8_1/lstm_16_1/zeros_1/packed",
                "op": "Pack",
                "input": [
                    "StatefulPartitionedCall/functional_8_1/lstm_16_1/strided_slice",
                    "StatefulPartitionedCall/functional_8_1/lstm_16_1/zeros_1/packed/1"
                ],
                "attr": {
                    "N": {
                        "i": "2"
                    },
                    "axis": {
                        "i": "0"
                    },
                    "T": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/functional_8_1/lstm_16_1/zeros",
                "op": "Fill",
                "input": [
                    "StatefulPartitionedCall/functional_8_1/lstm_16_1/zeros/packed",
                    "StatefulPartitionedCall/functional_8_1/lstm_16_1/zeros/Const"
                ],
                "attr": {
                    "_has_manual_control_dependencies": {
                        "b": true
                    },
                    "T": {
                        "type": "DT_FLOAT"
                    },
                    "index_type": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/functional_8_1/lstm_16_1/zeros_1",
                "op": "Fill",
                "input": [
                    "StatefulPartitionedCall/functional_8_1/lstm_16_1/zeros_1/packed",
                    "StatefulPartitionedCall/functional_8_1/lstm_16_1/zeros_1/Const"
                ],
                "attr": {
                    "_has_manual_control_dependencies": {
                        "b": true
                    },
                    "T": {
                        "type": "DT_FLOAT"
                    },
                    "index_type": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/functional_8_1/lstm_16_1/while/LoopControlInputs/_26",
                "op": "NoOp",
                "input": [
                    "^StatefulPartitionedCall/functional_8_1/lstm_16_1/TensorArrayUnstack/TensorListFromTensor",
                    "^StatefulPartitionedCall/functional_8_1/lstm_16_1/TensorArrayV2_1",
                    "^StatefulPartitionedCall/functional_8_1/lstm_16_1/zeros",
                    "^StatefulPartitionedCall/functional_8_1/lstm_16_1/zeros_1"
                ],
                "attr": {
                    "_has_manual_control_dependencies": {
                        "b": true
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/functional_8_1/lstm_16_1/while/enter/_20",
                "op": "Enter",
                "input": [
                    "StatefulPartitionedCall/functional_8_1/lstm_16_1/zeros",
                    "^StatefulPartitionedCall/functional_8_1/lstm_16_1/while/LoopControlInputs/_26"
                ],
                "attr": {
                    "is_constant": {
                        "b": false
                    },
                    "frame_name": {
                        "s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZnVuY3Rpb25hbF84XzEvbHN0bV8xNl8xL3doaWxl"
                    },
                    "T": {
                        "type": "DT_FLOAT"
                    },
                    "parallel_iterations": {
                        "i": "32"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/functional_8_1/lstm_16_1/while/enter/_22",
                "op": "Enter",
                "input": [
                    "StatefulPartitionedCall/functional_8_1/lstm_16_1/TensorArrayUnstack/TensorListFromTensor",
                    "^StatefulPartitionedCall/functional_8_1/lstm_16_1/while/LoopControlInputs/_26"
                ],
                "attr": {
                    "is_constant": {
                        "b": false
                    },
                    "frame_name": {
                        "s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZnVuY3Rpb25hbF84XzEvbHN0bV8xNl8xL3doaWxl"
                    },
                    "T": {
                        "type": "DT_VARIANT"
                    },
                    "parallel_iterations": {
                        "i": "32"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/functional_8_1/lstm_16_1/while/enter/_17",
                "op": "Enter",
                "input": [
                    "StatefulPartitionedCall/functional_8_1/lstm_16_1/Max",
                    "^StatefulPartitionedCall/functional_8_1/lstm_16_1/while/LoopControlInputs/_26"
                ],
                "attr": {
                    "is_constant": {
                        "b": false
                    },
                    "frame_name": {
                        "s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZnVuY3Rpb25hbF84XzEvbHN0bV8xNl8xL3doaWxl"
                    },
                    "T": {
                        "type": "DT_INT32"
                    },
                    "parallel_iterations": {
                        "i": "32"
                    }
